# BuiltInFailures.PointFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PointFailures Class
BuiltInFailures Class Members See Also
---
Failures about Point Element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class PointFailures
```

Visual Basic
---
```text
Public NotInheritable Class PointFailures
```

Visual C++
---
```text
public ref class PointFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..PointFailures
# See Also
BuiltInFailures..::..PointFailures Members
Autodesk.Revit.DB Namespace